Autodesk.Revit.DB.Document.GetElementsChangedInMemory(System.Guid)
Extracts a collection containing the ids of elements that have been created, modified or deleted between the input baseVersion and the document's current version,
including the changed elements only changed in memory but not serialized to project file due to the computed parameters.
baseVersionGUID:
GUID of base version(excluded) to compare. This GUID should be retrieved from property Autodesk::Revit::DB::DocumentVersion::VersoinGUID.
Empty GUID is allowed to retrieve changes of each version in the document.
Returns:
An object containing collections of the created, modified and deleted ids between the input version and current version.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This GUID is invalid in the given document.
Since:
2027

Autodesk.Revit.DB.Document.Link(System.String,Autodesk.Revit.DB.AXMImportOptions,Autodesk.Revit.DB.View)
Links an AXM file into the document.
Link isn't supported for family documents.  Please use import instead.
file:
Full path of the file to link. File must exist and must be a valid AXM file.
options:
Various link options applicable to the AXM format. If null, all options will be set to their respective default values.
Link FormIt support Preserve color mode, center-to-center and origin-to-origin placement. Other options are not supported.
Link FormIt does not support this view only option.
Link FormIt does not support import levels.
pDBView:
View used to aid placement of the linked file. If the options specify center-to-center placement, this argument is required and the linked
file will be placed in the center of the specified view. Otherwise, this view is used to obtain a base level to associate with the linked
file.  If not specified, an existing view will be chosen instead and may open a view or associate the linked file to an arbitrary level.
Returns:
Returns the element Id of the linked instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for AXM import (.axm files are valid).
-or-
The provided view is not valid for the options provided.
-or-
Visible layer only option is not false or layers are specified in SetLayerSelection.
-or-
Import levels is not supported for AXM link.
-or-
Not all AXM import option settings are valid. For more details, please refer to AXMImportOptions.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
NullOrEmpty
-or-
The view is not printable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
-or-
This Document is not a project document.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The Material Library is missing in the installed Revit.
-or-
The AXM Import/Link module is not available in the installed Revit.
Since:
2023

Autodesk.Revit.DB.Document.Update(System.String,Autodesk.Revit.DB.ATFXImportOptions)
Updates the current Revit project document which was created by an import of an ATFX file.
file:
Full path of the file to update. File must exist and must be a valid ATFX file.
options:
Various import options applicable to the ATFX format.
Returns:
Returns the element Ids of the created DirectShapes.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for ATFX import (.atfxz files are valid).
-or-
NullOrEmpty
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
-or-
Document this Document may not contain DirectShape or DirectShapeType objects.
-or-
This Document is not a project document.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The ShapeImporter functionality is not available in the installed Revit, or the Material Library is missing.
Since:
2023

Autodesk.Revit.DB.Document.Import(System.String,Autodesk.Revit.DB.ATFXImportOptions)
Imports an ATFX file into the document.
file:
Full path of the file to import. File must exist and must be a valid ATFX file.
options:
Various import options applicable to the ATFX format.
Returns:
Returns the element Ids of the created DirectShapes.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for ATFX import (.atfxz files are valid).
-or-
NullOrEmpty
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
-or-
Document this Document may not contain DirectShape or DirectShapeType objects.
-or-
This Document is not a project document.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The ShapeImporter functionality is not available in the installed Revit, or the Material Library is missing.
Since:
2023

Autodesk.Revit.DB.Document.Update(System.String,Autodesk.Revit.DB.ATFXMLImportOptions)
Updates the current Revit project document which was created by an import of an ATF XML file.
file:
Full path of the file to update. File must exist and must be a valid ATF XML file.
options:
Various import options applicable to the ATF XML format.
Returns:
Returns the element Ids of the created DirectShapes.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for ATFXML import (.atfx files are valid).
-or-
NullOrEmpty
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
-or-
Document this Document may not contain DirectShape or DirectShapeType objects.
-or-
This Document is not a project document.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The ShapeImporter functionality is not available in the installed Revit, or the Material Library is missing.
Since:
2022

Autodesk.Revit.DB.Document.Import(System.String,Autodesk.Revit.DB.ATFXMLImportOptions)
Imports an ATF XML file into the project document.
file:
Full path of the file to import. File must exist and must be a valid ATF XML file.
options:
Various import options applicable to the ATF XML format.
Returns:
Returns the element Ids of the created DirectShapes.
Throws Autodesk.Revit.Exceptions.ArgumentException:
NullOrEmpty
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
-or-
Document this Document may not contain DirectShape or DirectShapeType objects.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The ShapeImporter functionality is not available in the installed Revit, or the Material Library is missing.
Since:
2022

Autodesk.Revit.DB.Document.Export(System.String,System.String,Autodesk.Revit.DB.USDExportOptions)
Exports the document to the USD format.
folder:
Output folder into which the file will be exported. The folder must exist.
name:
Indicates the name of the USD file to export. If it doesn't end with ".usd", ".usda", ".usdc", ".usdz",
a ".usd" extension will be added automatically.
The name cannot contain any of the following characters: \/:*?"<>|. Empty name is not acceptable.
options:
Various options applicable to the USD format.
Returns:
True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentException:
NullOrEmpty
-or-
Contains invalid characters.
-or-
The provided options do not specify a printable 3D view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
This method may not be called during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Export is temporarily disabled.
-or-
Exporting is not allowed in the current application mode.
Throws Autodesk.Revit.Exceptions.InvalidPathArgumentException:
The folder does not exist.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The ShapeExporter functionality is not available in the installed Revit, or the Material Library is missing.
Since:
2027

Autodesk.Revit.DB.Document.Export(System.String,System.String,Autodesk.Revit.DB.ATFGBXMLExportOptions)
Exports the document to the gbXML format.
folder:
Output folder into which the file will be exported. The folder must exist.
name:
Indicates the name of the gbXML file to export. If it doesn't end with ".gbxml" or ".xml", this extension will be added automatically.
The name cannot contain any of the following characters: \/:*?"<>|. Empty name is not acceptable.
options:
Various options applicable to the gbXML format.
Returns:
True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentException:
NullOrEmpty
-or-
Contains invalid characters.
-or-
The provided options do not specify a printable 3D view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
This method may not be called during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Document is not a project document.
-or-
This Document is in an edit mode.
-or-
Export is temporarily disabled.
-or-
Exporting is not allowed in the current application mode.
Throws Autodesk.Revit.Exceptions.InvalidPathArgumentException:
The folder does not exist.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The ShapeExporter functionality is not available in the installed Revit, or the Material Library is missing.
Since:
2026

Autodesk.Revit.DB.Document.WorkshareCloudModel(System.String)
Enables worksharing for this document. Journal messages match saveAsCloudSharedModel
Remarks:
Assumes that user is currently signed in.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.Document.SaveAsCloudModel(Autodesk.Revit.DB.ForgeDM.CloudFolder,System.String)
Saves current non-workshared or workshared model as a cloud model or workshared cloud model.
Remarks:
Assumes that user is currently signed and has access to Autodesk cloud services.
This operation will create a model on cloud and then create a local cache of the cloud model.
This method cannot be used when current document is already in cloud.
You can use one of the following methods to save a local model as a workshared cloud model.
If the local model is a workshared model, then it will be a workshared cloud model after you use this method successfully.  If the local model is a non-workshared model, you can enable the workset with Autodesk.Revit.DB.Document.EnableWorksharing(System.String,System.String) and then save as a workshared cloud model.  If the local model is a non-workshared model, and you have already saved it as a non-workshared cloud model, you can still enable the workset with
Autodesk.Revit.DB.Document.EnableCloudWorksharing to convert it to a workshared cloud model.
You cannot save a local workshared model as a non-workshared cloud model.
cloudFolder:
The Folder from ForgeDM to save the model.
modelName:
Model name to save the model.
Throws Autodesk.Revit.Exceptions.ArgumentException:
modelName is an empty string.
-or-
The input file name "modelName" does not represent a valid file name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.CentralModelMissingException:
Failed due to the region of the input CloudFolder is invalid.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
SaveAs may not be called during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Saving is not allowed in the current application mode.
-or-
This Document is not a project document.
-or-
This Document is in an edit mode.
-or-
This Document is not a primary document, it is a linked document.
-or-
SaveAs is temporarily disabled.
-or-
This Document is a cloud model, cannot be saved as a cloud model.
-or-
There is a transaction phase left open (such as a transaction, sub-transaction of transaction group) at the time of invoking this method.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
Could be for any of the reasons related to network.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
Failed because the input CloudFolder contains an invalid or mismatched account ID or project ID.
-or-
Could be for any of the reasons that saveAs fails with RevitServerInternalException.
Throws Autodesk.Revit.Exceptions.RevitServerModelAlreadyExistsException:
Failed due to there is a model with the same name already exists at the specified location.
Throws Autodesk.Revit.Exceptions.RevitServerModelNameBreaksConventionException:
Failed due to the model name is breaking project naming convention.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException:
User is not signed in with Autodesk id.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
You don't have the entitlement to perform the operation to this this Document.
-or-
User is not authorized to access the specified cloud project.
Since:
2022

Autodesk.Revit.DB.Document.GetActiveEditMode
Returns the document's active edit mode. Returns None if no edit mode is currently active.
Since:
2026

Autodesk.Revit.DB.Document.Delete(Autodesk.Revit.DB.ElementId)
Deletes an element from the document given the id of that element.
Remarks:
This method will delete the element and any elements that are totally dependent upon that element. Any references to the deleted elements will become invalid and hence cause an exception to be thrown if they are accessed.
The elements will be deleted with no prompts for user confirmation. If pinned elements cannot be deleted before being unpinned, an exception will be thrown.
Note: in a family document, the predefined elements (those elements inherited from its family template file) can't be deleted by this method.
elementId:
Id of the element to delete.
Returns:
The deleted element id set.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element elementId does not exist in the document
-or-
ElementId cannot be deleted.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.

Autodesk.Revit.DB.Document.SetDefaultFamilyTypeId(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Sets the default family type id for the given family category.
familyCategoryId:
The family category id.
familyTypeId:
The default family type id.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The family type id familyTypeId is invalid for the give family category familyCategoryId.
-or-
familyCategoryId is not a built in category or parameter Element ID.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.Document.GetDefaultFamilyTypeId(Autodesk.Revit.DB.ElementId)
Gets the default family type id with the given family category id.
familyCategoryId:
The family category id.
Returns:
The default family type id.
Throws Autodesk.Revit.Exceptions.ArgumentException:
familyCategoryId is not a built in category or parameter Element ID.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2015

Autodesk.Revit.DB.Document.Export(System.String,System.String,Autodesk.Revit.DB.GBXMLExportOptions)
Export the model in gbXML (green-building) format.
Remarks:
This export operation will operate on the main EnergyAnalysisDetailModel in the document, if it exists (see EnergyAnalysisDetailModel.GetMainEnergyAnalysisDetailModel()).
If it does not exist, or if the requested ExportEnergyModelType does not match the type of the main EnergyAnalysisDetailModel, this function will fail.
If you need to export a model with different settings or type than the current main energy model in the document, you should delete the current main energy model, update the EnergyAnalysisSettings, and regenerate the energy model.
This method should be called from a transaction.
folder:
Indicates the path of a folder where to export the gbXML file.
name:
Indicates the name of the gbXML file to export. If it doesn't end with ".xml", extension ".xml" will be added automatically. The name cannot contain any of the following characters: \/:*?"<>|. Empty name is not acceptable.
options:
Options which control the contents of the export.
Returns:
True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The path is not valid for exporting gbXML files.
-or-
The name is empty or not valid for exporting gbXML files.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Document is not a project document.
-or-
This Document is in an edit mode.
-or-
Exporting is not allowed in the current application mode.
-or-
Export is temporarily disabled.
-or-
There is no EnergyAnalysisDetailModel in the document.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.

Autodesk.Revit.DB.Document.Import(System.String,Autodesk.Revit.DB.AXMImportOptions,Autodesk.Revit.DB.View)
Imports an AXM file into the document.
file:
Full path of the file to import. File must exist and must be a valid AXM file.
options:
Various import options applicable to the AXM format. If null, all options will be set to their respective default values.
Import FormIt support Preserve color mode, center-to-center and origin-to-origin placement, other options are not supported.
Import FormIt does not support orient to view and this view only option.
pDBView:
View used to aid placement of the imported file. If the options specify center-to-center placement, this argument is required and the imported
file will be placed in the center of the specified view. Otherwise, this view is used to obtain a base level to associate with the imported
file.  If not specified, an existing view will be chosen instead and may open a view or associate the imported file to an arbitrary level.
Returns:
Returns the element Id of the imported instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for AXM import (.axm files are valid).
-or-
The provided view is not valid for the options provided.
-or-
Visible layer only option is not false or layers are specified in SetLayerSelection.
-or-
Import levels is only supported in project document or conceptual mass document for AXM import.
-or-
Not all AXM import option settings are valid. For more details, please refer to AXMImportOptions.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
NullOrEmpty
-or-
The view is not printable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The Material Library is missing in the installed Revit.
-or-
The AXM Import/Link module is not available in the installed Revit.
Since:
2022.1

Autodesk.Revit.DB.Document.Link(System.String,Autodesk.Revit.DB.DGNImportOptions,Autodesk.Revit.DB.View,Autodesk.Revit.DB.ElementId@)
Links a DGN file into the project document.
Remarks:
Link isn't supported for family documents.  Please use import instead.
file:
Full path of the file to link. File must exist and must be a valid DGN file.
options:
Various import options applicable to the DGN format. If null, all options will be set to their respective default values.
pDBView:
View used to aid placement of the linked file. If the options specify ThisViewOnly, this argument is required and the linked file
will only be visible in the specified view. If the options specify center-to-center placement, this argument is required and the linked
file will be placed in the center of the specified view. Otherwise, this view is used to obtain a base level to associate with the linked
file.  If not specified, an existing view will be chosen instead and may open a view or associate the linked file to an arbitrary level.
elementId:
The id of linked instance after a successful link.
Returns:
True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for DGN import (.dgn files are valid).
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view.
-or-
The provided view is not valid for the options provided.
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
NullOrEmpty
-or-
The view is not printable.
-or-
Empty DGN model view name characters.
-or-
Visible layer only option must be set to false for DGN import.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
-or-
This Document is not a project document.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The Material Library is missing in the installed Revit.
-or-
The DGN Import/Link module is not available in the installed Revit.
Since:
2013

Autodesk.Revit.DB.Document.Import(System.String,Autodesk.Revit.DB.DGNImportOptions,Autodesk.Revit.DB.View,Autodesk.Revit.DB.ElementId@)
Imports a DGN file to the document.
file:
Full path of the file to import. File must exist and must be a valid DGN file.
options:
Various options applicable to the DGN format. If null, all options will be set to their respective default values.
pDBView:
View used to aid placement of the imported file. If the options specify ThisViewOnly, this argument is required and the imported file
will only be visible in the specified view. If the options specify center-to-center placement, this argument is required and the imported
file will be placed in the center of the specified view. Otherwise, this view is used to obtain a base level to associate with the imported
file.  If not specified, an existing view will be chosen instead and may open a view or associate the imported file to an arbitrary level.
elementId:
The id of imported instance after a successful import.
Returns:
True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for DGN import (.dgn files are valid).
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view.
-or-
The provided view is not valid for the options provided.
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
NullOrEmpty
-or-
The view is not printable.
-or-
Empty DGN model view name characters.
-or-
Visible layer only option must be set to false for DGN import.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The Material Library is missing in the installed Revit.
-or-
The DGN Import/Link module is not available in the installed Revit.
Since:
2013

Autodesk.Revit.DB.Document.Link(System.String,Autodesk.Revit.DB.ImportOptions3DM,Autodesk.Revit.DB.View)
Links a 3DM file into the project document.
Remarks:
Link isn't supported for family documents.  Please use import instead.
file:
Full path of the file to link. File must exist and must be a valid 3DM file.
options:
Various import options applicable to the 3DM format. If null, all options will be set to their respective default values.
pDBView:
View used to aid placement of the linked file. If the options specify ThisViewOnly, this argument is required and the linked file
will only be visible in the specified view. If the options specify center-to-center placement, this argument is required and the linked
file will be placed in the center of the specified view. Otherwise, this view is used to obtain a base level to associate with the linked
file.  If not specified, an existing view will be chosen instead and may open a view or associate the linked file to an arbitrary level.
Returns:
Returns the element Id of the linked instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for 3DM import (.3dm files are valid).
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view.
-or-
The provided view is not valid for the options provided.
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
NullOrEmpty
-or-
The view is not printable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
-or-
This Document is not a project document.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The Material Library is missing in the installed Revit.
-or-
The 3DM Import/Link module is not available in the installed Revit.
Since:
2022

Autodesk.Revit.DB.Document.Import(System.String,Autodesk.Revit.DB.ImportOptions3DM,Autodesk.Revit.DB.View)
Imports a 3DM file into the document.
file:
Full path of the file to import. File must exist and must be a valid 3DM file.
options:
Various import options applicable to the 3DM format. If null, all options will be set to their respective default values.
pDBView:
View used to aid placement of the imported file. If the options specify ThisViewOnly, this argument is required and the imported file
will only be visible in the specified view. If the options specify center-to-center placement, this argument is required and the imported
file will be placed in the center of the specified view. Otherwise, this view is used to obtain a base level to associate with the imported
file.  If not specified, an existing view will be chosen instead and may open a view or associate the imported file to an arbitrary level.
Returns:
Returns the element Id of the imported instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for 3DM import (.3dm files are valid).
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view.
-or-
The provided view is not valid for the options provided.
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
NullOrEmpty
-or-
The view is not printable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The Material Library is missing in the installed Revit.
-or-
The 3DM Import/Link module is not available in the installed Revit.
Since:
2022

Autodesk.Revit.DB.Document.Link(System.String,Autodesk.Revit.DB.STLImportOptions,Autodesk.Revit.DB.View)
Links an STL file into the project document.
Remarks:
Link isn't supported for family documents.  Please use import instead.
file:
Full path of the file to link. File must exist and must be a valid STL file.
options:
Various import options applicable to the STL format. If null, all options will be set to their respective default values.
pDBView:
View used to aid placement of the linked file. If the options specify ThisViewOnly, this argument is required and the linked file
will only be visible in the specified view. If the options specify center-to-center placement, this argument is required and the linked
file will be placed in the center of the specified view. Otherwise, this view is used to obtain a base level to associate with the linked
file.  If not specified, an existing view will be chosen instead and may open a view or associate the linked file to an arbitrary level.
Returns:
Returns the element Id of the linked instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for STL import (.stl files are valid).
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view.
-or-
The provided view is not valid for the options provided.
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
NullOrEmpty
-or-
The view is not printable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
-or-
This Document is not a project document.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The Material Library is missing in the installed Revit.
-or-
The STL Import/Link module is not available in the installed Revit.
Since:
2023

Autodesk.Revit.DB.Document.Import(System.String,Autodesk.Revit.DB.STLImportOptions,Autodesk.Revit.DB.View)
Imports an STL file into the document.
file:
Full path of the file to import. File must exist and must be a valid STL file.
options:
Various import options applicable to the STL format. If null, all options will be set to their respective default values.
pDBView:
View used to aid placement of the imported file. If the options specify ThisViewOnly, this argument is required and the imported file
will only be visible in the specified view. If the options specify center-to-center placement, this argument is required and the imported
file will be placed in the center of the specified view. Otherwise, this view is used to obtain a base level to associate with the imported
file.  If not specified, an existing view will be chosen instead and may open a view or associate the imported file to an arbitrary level.
Returns:
Returns the element Id of the imported instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for STL import (.stl files are valid).
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view.
-or-
The provided view is not valid for the options provided.
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
NullOrEmpty
-or-
The view is not printable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The Material Library is missing in the installed Revit.
-or-
The STL Import/Link module is not available in the installed Revit.
Since:
2022.1

Autodesk.Revit.DB.Document.Link(System.String,Autodesk.Revit.DB.STEPImportOptions,Autodesk.Revit.DB.View)
Links an STEP file into the project document.
Remarks:
Link isn't supported for family documents. Please use import instead.
file:
Full path of the file to link. File must exist and must be a valid STEP file.
options:
Various import options applicable to the STEP format. If null, all options will be set to their respective default values.
pDBView:
View used to aid placement of the linked file. If the options specify ThisViewOnly, this argument is required and the linked file
will only be visible in the specified view. If the options specify center-to-center placement, this argument is required and the linked
file will be placed in the center of the specified view. Otherwise, this view is used to obtain a base level to associate with the linked
file.  If not specified, an existing view will be chosen instead and may open a view or associate the linked file to an arbitrary level.
Returns:
Returns the element Id of the linked instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for STEP import (.step, .stp., .stpz files are valid).
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view.
-or-
The provided view is not valid for the options provided.
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
NullOrEmpty
-or-
The view is not printable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
-or-
This Document is not a project document.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The Material Library is missing in the installed Revit.
-or-
The STEP Import/Link module is not available in the installed Revit.
Since:
2025

Autodesk.Revit.DB.Document.Import(System.String,Autodesk.Revit.DB.STEPImportOptions,Autodesk.Revit.DB.View)
Imports a STEP file into the document.
file:
Full path of the file to import. File must exist and must be a valid STEP file.
options:
Various import options applicable to the STEP format. If null, all options will be set to their respective default values.
pDBView:
View used to aid placement of the imported file. If the options specify ThisViewOnly, this argument is required and the imported file
will only be visible in the specified view. If the options specify center-to-center placement, this argument is required and the imported
file will be placed in the center of the specified view. Otherwise, this view is used to obtain a base level to associate with the imported
file.  If not specified, an existing view will be chosen instead and may open a view or associate the imported file to an arbitrary level.
Returns:
Returns the element Id of the imported instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for STEP import (.step, .stp., .stpz files are valid).
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view.
-or-
The provided view is not valid for the options provided.
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
NullOrEmpty
-or-
The view is not printable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The Material Library is missing in the installed Revit.
-or-
The STEP Import/Link module is not available in the installed Revit.
Since:
2024.2

Autodesk.Revit.DB.Document.Link(System.String,Autodesk.Revit.DB.OBJImportOptions,Autodesk.Revit.DB.View)
Links an OBJ file into the project document.
Remarks:
Link isn't supported for family documents.  Please use import instead.
file:
Full path of the file to link. File must exist and must be a valid OBJ file.
options:
Various import options applicable to the OBJ format. If null, all options will be set to their respective default values.
pDBView:
View used to aid placement of the linked file. If the options specify ThisViewOnly, this argument is required and the linked file
will only be visible in the specified view. If the options specify center-to-center placement, this argument is required and the linked
file will be placed in the center of the specified view. Otherwise, this view is used to obtain a base level to associate with the linked
file.  If not specified, an existing view will be chosen instead and may open a view or associate the linked file to an arbitrary level.
Returns:
Returns the element Id of the linked instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for OBJ import (.obj files are valid).
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view.
-or-
The provided view is not valid for the options provided.
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
NullOrEmpty
-or-
The view is not printable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
-or-
This Document is not a project document.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The Material Library is missing in the installed Revit.
-or-
The OBJ Import/Link module is not available in the installed Revit.
Since:
2023

Autodesk.Revit.DB.Document.Import(System.String,Autodesk.Revit.DB.OBJImportOptions,Autodesk.Revit.DB.View)
Imports an OBJ file into the document.
file:
Full path of the file to import. File must exist and must be a valid OBJ file.
options:
Various import options applicable to the OBJ format. If null, all options will be set to their respective default values.
pDBView:
View used to aid placement of the imported file. If the options specify ThisViewOnly, this argument is required and the imported file
will only be visible in the specified view. If the options specify center-to-center placement, this argument is required and the imported
file will be placed in the center of the specified view. Otherwise, this view is used to obtain a base level to associate with the imported
file.  If not specified, an existing view will be chosen instead and may open a view or associate the imported file to an arbitrary level.
Returns:
Returns the element Id of the imported instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for OBJ import (.obj files are valid).
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view.
-or-
The provided view is not valid for the options provided.
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
NullOrEmpty
-or-
The view is not printable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The Material Library is missing in the installed Revit.
-or-
The OBJ Import/Link module is not available in the installed Revit.
Since:
2022.1

Autodesk.Revit.DB.Document.Link(System.String,Autodesk.Revit.DB.SKPImportOptions,Autodesk.Revit.DB.View)
Links a SKP file into the project document.
Remarks:
Link isn't supported for family documents.  Please use import instead.
file:
Full path of the file to link. File must exist and must be a valid SKP file.
options:
Various import options applicable to the SKP format. If null, all options will be set to their respective default values.
pDBView:
View used to aid placement of the linked file. If the options specify ThisViewOnly, this argument is required and the linked file
will only be visible in the specified view. If the options specify center-to-center placement, this argument is required and the linked
file will be placed in the center of the specified view. Otherwise, this view is used to obtain a base level to associate with the linked
file.  If not specified, an existing view will be chosen instead and may open a view or associate the linked file to an arbitrary level.
Returns:
Returns the element Id of the linked instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for SKP import (.skp files are valid).
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view.
-or-
The provided view is not valid for the options provided.
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
NullOrEmpty
-or-
The view is not printable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
-or-
This Document is not a project document.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The Material Library is missing in the installed Revit.
-or-
The SKP Import/Link module is not available in the installed Revit.
Since:
2014

Autodesk.Revit.DB.Document.Import(System.String,Autodesk.Revit.DB.SKPImportOptions,Autodesk.Revit.DB.View)
Imports a SKP file into the document.
file:
Full path of the file to import. File must exist and must be a valid SKP file.
options:
Various import options applicable to the SKP format. If null, all options will be set to their respective default values.
pDBView:
View used to aid placement of the imported file. If the options specify ThisViewOnly, this argument is required and the imported file
will only be visible in the specified view. If the options specify center-to-center placement, this argument is required and the imported
file will be placed in the center of the specified view. Otherwise, this view is used to obtain a base level to associate with the imported
file.  If not specified, an existing view will be chosen instead and may open a view or associate the imported file to an arbitrary level.
Returns:
Returns the element Id of the imported instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for SKP import (.skp files are valid).
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view.
-or-
The provided view is not valid for the options provided.
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
NullOrEmpty
-or-
The view is not printable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The Material Library is missing in the installed Revit.
-or-
The SKP Import/Link module is not available in the installed Revit.
Since:
2014

Autodesk.Revit.DB.Document.Link(System.String,Autodesk.Revit.DB.SATImportOptions,Autodesk.Revit.DB.View)
Links an SAT file into the project document.
Remarks:
Link isn't supported for family documents.  Please use import instead.
file:
Full path of the file to link. File must exist and must be a valid SAT file.
options:
Various import options applicable to the SAT format. If null, all options will be set to their respective default values.
pDBView:
View used to aid placement of the linked file. If the options specify ThisViewOnly, this argument is required and the linked file
will only be visible in the specified view. If the options specify center-to-center placement, this argument is required and the linked
file will be placed in the center of the specified view. Otherwise, this view is used to obtain a base level to associate with the linked
file.  If not specified, an existing view will be chosen instead and may open a view or associate the linked file to an arbitrary level.
Returns:
Returns the element Id of the linked instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for SAT import (.sat files are valid).
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view.
-or-
The provided view is not valid for the options provided.
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
NullOrEmpty
-or-
The view is not printable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
-or-
This Document is not a project document.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The Material Library is missing in the installed Revit.
-or-
The SAT Import/Link module is not available in the installed Revit.
Since:
2014

Autodesk.Revit.DB.Document.Import(System.String,Autodesk.Revit.DB.SATImportOptions,Autodesk.Revit.DB.View)
Imports an SAT file into the document.
file:
Full path of the file to import. File must exist and must be a valid SAT file.
options:
Various import options applicable to the SAT format. If null, all options will be set to their respective default values.
pDBView:
View used to aid placement of the imported file. If the options specify ThisViewOnly, this argument is required and the imported file
will only be visible in the specified view. If the options specify center-to-center placement, this argument is required and the imported
file will be placed in the center of the specified view. Otherwise, this view is used to obtain a base level to associate with the imported
file.  If not specified, an existing view will be chosen instead and may open a view or associate the imported file to an arbitrary level.
Returns:
Returns the element Id of the imported instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for SAT import (.sat files are valid).
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view.
-or-
The provided view is not valid for the options provided.
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
NullOrEmpty
-or-
The view is not printable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The Material Library is missing in the installed Revit.
-or-
The SAT Import/Link module is not available in the installed Revit.
Since:
2014

Autodesk.Revit.DB.Document.Link(System.String,Autodesk.Revit.DB.DWGImportOptions,Autodesk.Revit.DB.View,Autodesk.Revit.DB.ElementId@)
Links a DWG or DXF file into the project document.
Remarks:
Link isn't supported for family documents.  Please use import instead.
file:
Full path of the file to link. File must exist and must be a valid DWG or DXF file.
options:
Various import options applicable to the DWG or DXF format. If null, all options will be set to their respective default values.
pDBView:
View used to aid placement of the linked file. If the options specify ThisViewOnly, this argument is required and the linked file
will only be visible in the specified view. If the options specify center-to-center placement, this argument is required and the linked
file will be placed in the center of the specified view. Otherwise, this view is used to obtain a base level to associate with the linked
file.  If not specified, an existing view will be chosen instead and may open a view or associate the linked file to an arbitrary level.
elementId:
The id of linked instance after a successful link.
Returns:
True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for DWG import (.dwg and .dxf files are valid).
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view.
-or-
The provided view is not valid for the options provided.
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The line weights are not valid; either it contains an invalid number of line weights, or a line weight outside the valid range.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
NullOrEmpty
-or-
The view is not printable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
-or-
This Document is not a project document.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The Material Library is missing in the installed Revit.
-or-
The DWG Import/Link module is not available in the installed Revit.

Autodesk.Revit.DB.Document.Import(System.String,Autodesk.Revit.DB.DWGImportOptions,Autodesk.Revit.DB.View,Autodesk.Revit.DB.ElementId@)
Imports a DWG or DXF file to the document.
file:
Full path of the file to import. File must exist and must be a valid DWG or DXF file.
options:
Various options applicable to the DWG or DXF format. If null, all options will be set to their respective default values.
pDBView:
View used to aid placement of the imported file. If the options specify ThisViewOnly, this argument is required and the imported file
will only be visible in the specified view. If the options specify center-to-center placement, this argument is required and the imported
file will be placed in the center of the specified view. Otherwise, this view is used to obtain a base level to associate with the imported
file.  If not specified, an existing view will be chosen instead and may open a view or associate the imported file to an arbitrary level.
elementId:
The id of imported instance after a successful import.
Returns:
True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Not a valid file for DWG import (.dwg and .dxf files are valid).
-or-
ThisViewOnly cannot be true when importing a DWG|DGN drawing into a 3D view.
-or-
The provided view is not valid for the options provided.
-or-
One or more strings describing layer selection is invalid or empty.
-or-
The line weights are not valid; either it contains an invalid number of line weights, or a line weight outside the valid range.
-or-
The scale is not valid as a CustomScale for use during import.
-or-
NullOrEmpty
-or-
The view is not printable.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given file does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Import is temporarily disabled.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The Material Library is missing in the installed Revit.
-or-
The DWG Import/Link module is not available in the installed Revit.

Autodesk.Revit.DB.Document.Export(System.String,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.PDFExportOptions)
Exports a selection of views in PDF format.
folder:
Output folder, into which file(s) will be exported. The folder must exist.
viewIds:
Selection of ordered views to be exported.
The list must contain at least one valid view.
options:
Various options applicable to the PDF format.
Returns:
True if all specified views are exported successfully,
False if exporting of any view fails, even if some views might have been exported successfully.
Throws Autodesk.Revit.Exceptions.ArgumentException:
non empty list of views must be provided.
-or-
NullOrEmpty
-or-
There are duplicate views in viewIds
-or-
some of the views are not printable (exportable).
-or-
Thrown when one or more input arguments are invalid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileAccessException:
Thrown when the target PDF file is inaccessible, e.g. already opened.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
"Running background tasks is disabled when DisableBackgroundProcesses is set in Revit.ini."
-or-
"A background process is already running in this document."
-or-
"The maximum number of background processes (3) has been reached."
-or-
Cannot export PDF in the background while in edit mode.
-or-
Running background tasks is not allowed in a Family document.
-or-
Export is temporarily disabled.
-or-
Exporting is not allowed in the current application mode.
Throws Autodesk.Revit.Exceptions.InvalidPathArgumentException:
The folder does not exist.
Since:
2022

Autodesk.Revit.DB.Document.Export(System.String,System.String,Autodesk.Revit.DB.IFCExportOptions)
Exports the document to the Industry Standard Classes (IFC) format.
Remarks:
Exporting to IFC requires that document is modifiable, therefore there must be a transaction already open when this method is called.
This method may not be invoked during dynamic update, for the internal routine might need to modify the existing transaction.
folder:
Output folder into which the file will be exported. The folder must exist.
name:
Either the name of a single file or a prefix for a set of files.
If empty, automatic naming will be used.
options:
Various options applicable to the IFC format.
If null, all options will be set to their respective default values.
Returns:
True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentException:
NullOrEmpty
-or-
Contains invalid characters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The IFCExportOptions FamilyMappingFile does not exist.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
This method may not be called during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Export is temporarily disabled.
-or-
Exporting is not allowed in the current application mode.
-or-
This Document is in an edit mode.
-or-
This Document is not a project document.
Throws Autodesk.Revit.Exceptions.InvalidPathArgumentException:
The folder does not exist.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The IFC module is not available in the installed Revit.

Autodesk.Revit.DB.Document.Export(System.String,System.String,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.SATExportOptions)
Exports the current view or a selection of views in SAT format.
Remarks:
All the views must be 3D views for the Export to succeed.
folder:
Output folder, into which file(s) will be exported. The folder must exist.
name:
Either the name of a single file or a prefix for a set of files.
If empty, automatic naming will be used.
views:
Selection of views to be exported. The set must contain at least one valid view.
options:
Various options applicable to the SAT format. For now, this option is empty.
If null, all options will be set to their respective default values.
Returns:
True if successful, otherwise False.
Throws Autodesk.Revit.Exceptions.ArgumentException:
NullOrEmpty
-or-
Contains invalid characters.
-or-
non empty list of views must be provided.
-or-
At least one provided viewId does not correspond to a printable 3D view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.DirectoryNotFoundException:
Thrown when the directory does not exist.
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
This method may not be called during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Export is temporarily disabled.
-or-
Exporting is not allowed in the current application mode.
Throws Autodesk.Revit.Exceptions.InvalidPathArgumentException:
The folder does not exist.
Throws Autodesk.Revit.Exceptions.OptionalFunctionalityNotAvailableException:
The ShapeExporter functionality is not available in the installed Revit, or the Material Library is missing.
Since:
2014

Autodesk.Revit.DB.Document.SaveAsCloudModel(System.Guid,System.Guid,System.String,System.String)
Saves current non-workshared or workshared model as a cloud model or workshared cloud model.
Remarks:
Assumes that user is currently signed and has access to Autodesk cloud services.
This operation will create a model on cloud and then create a local cache of the cloud model.
This method cannot be used when current document is already in cloud.
You can use one of the following methods to save a local model as a workshared cloud model.
If the local model is a workshared model, then it will be a workshared cloud model after you use this method successfully.  If the local model is a non-workshared model, you can enable the workset with Autodesk.Revit.DB.Document.EnableWorksharing(System.String,System.String) and then save as a workshared cloud model.  If the local model is a non-workshared model, and you have already saved it as a non-workshared cloud model, you can still enable the workset with
Autodesk.Revit.DB.Document.EnableCloudWorksharing to convert it to a workshared cloud model.
You cannot save a local workshared model as a non-workshared cloud model.
accountId:
Cloud Model account Id.
You can use one of the following methods to get this Id:
If you get the hub Id with Forge Data Management API, remove the prefix "b." of the Id string and convert the rest to a Guid.
projectId:
Cloud Model project Id in Autodesk Project.
You can use one of the following methods to get this Id:
If you get the project Id with Forge Data Management API, remove the prefix "b." of the Id string and convert the rest to a Guid.
folderId:
Folder identity to save the model in Autodesk Project.
You can use one of the following methods to get this Id:
The folder Id string from Forge Data Management API.
modelName:
Specify the model name in Autodesk Project to save the model.
Throws Autodesk.Revit.Exceptions.ArgumentException:
folderId is an empty string.
-or-
modelName is an empty string.
-or-
The input file name "modelName" does not represent a valid file name.
-or-
Thrown when the input account Id or project Id is invalid or unmatched.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ForbiddenForDynamicUpdateException:
SaveAs may not be called during dynamic update.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Saving is not allowed in the current application mode.
-or-
This Document is not a project document.
-or-
This Document is in an edit mode.
-or-
This Document is not a primary document, it is a linked document.
-or-
SaveAs is temporarily disabled.
-or-
This Document is a cloud model, cannot be saved as a cloud model.
-or-
There is a transaction phase left open (such as a transaction, sub-transaction of transaction group) at the time of invoking this method.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
Could be for any of the reasons related to network.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
Could be for any of the reasons that saveAs fails with RevitServerInternalException.
Throws Autodesk.Revit.Exceptions.RevitServerModelAlreadyExistsException:
Failed due to there is a model with the same name already exists at the specified location.
Throws Autodesk.Revit.Exceptions.RevitServerModelNameBreaksConventionException:
Failed due to the model name is breaking project naming convention.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException:
User is not signed in with Autodesk id.
Throws Autodesk.Revit.Exceptions.RevitServerUnauthorizedException:
You don't have the entitlement to perform the operation to this this Document.
-or-
User is not authorized to access the specified cloud project.
Since:
2021

Autodesk.Revit.DB.Document.SetAbortOpenFlag(Autodesk.Revit.DB.Document.DocumentAbortOpenStatus)
Sets the status to abort document opening with a specified reason.
This is an internal method used by document upgraders to signal critical failures.
status: The status/reason for aborting the document open operation.